Repository: aungyelin/myWallet
Catalog: myWallet/Resources/Localization/Localizable.xcstrings
Source language: en
Languages: my

# action_back_to_home
source: Back to Home
my: ပင်မစာမျက်နှာသို့ ပြန်သွားရန်

# action_cancel
source: Cancel
my: ပယ်ဖျက်ရန်

# action_clear
source: Clear
my: ရှင်းလင်းရန်

# action_copy
source: Copy
my: ကူးယူရန်

# action_done
source: Done
my: ပြီးပါပြီ

# action_filter
source: Filter
my: စစ်ထုတ်ရန်

# action_ok
source: OK
my: အိုကေ

# action_proceed
source: Proceed
my: ဆက်လုပ်ရန်

# action_proceed_to_recharge
source: Proceed to Recharge
my: ငွေဖြည့်ရန် ဆက်လုပ်ပါ

# action_recharge
source: Proceed to Recharge
my: ငွေဖြည့်ရန် ဆက်လုပ်ပါ

# action_recharge_hint
source: Start a new top-up for this phone number
my: ဤဖုန်းနံပါတ်အတွက် ငွေဖြည့်မှုအသစ် စတင်ရန်

# action_retry
source: Retry
my: ထပ်မံကြိုးစားရန်

# action_search
source: Search
my: ရှာဖွေရန်

# action_select
source: Select
my: ရွေးချယ်ရန်

# btn_history
source: Transaction History
my: မှတ်တမ်း

# btn_simulate_checkout
source: Confirm & Recharge
my: အတည်ပြုပြီး ငွေဖြည့်ရန်

# btn_top_up
source: Top-Up
my: မိုဘိုင်းငွေဖြည့်

source: Copied to clipboard
my: ကလစ်ဘုတ်သို့ ကူးယူပြီးပါပြီ

# detail_date
source: Date & Time
my: ရက်စွဲနှင့် အချိန်

# detail_fee
source: Fee
my: ဝန်ဆောင်ခ

# detail_plan
source: Plan / Details
my: အစီအစဉ် / အသေးစိတ်

# detail_recipient
source: Recipient
my: လက်ခံသူ

# detail_reference
source: Reference Number
my: ရည်ညွှန်းနံပါတ်

# detail_remark
source: Remark
my: မှတ်ချက်

# detail_status
source: Status
my: အခြေအနေ

# detail_type
source: Transaction Type
my: ငွေလွှဲအမျိုးအစား

# error_decoding_failure
source: Failed to decode data: %@
my: ဒေတာကို ဖတ်၍မရပါ: %@

# error_file_not_found
source: Resource file not found: %@
my: ရင်းမြစ်ဖိုင်ကို ရှာမတွေ့ပါ: %@

# error_invalid_phone_number
source: Please enter a valid Myanmar mobile number.
my: မှန်ကန်သော မြန်မာမိုဘိုင်းဖုန်းနံပါတ်ကို ထည့်ပါ။

# error_network_failure
source: Network connection error. Please try again.
my: ကွန်ရက်ချိတ်ဆက်မှု အမှားဖြစ်နေပါသည်။ ထပ်မံကြိုးစားပါ။

# error_package_not_found
source: The selected package or denomination could not be found.
my: ရွေးချယ်ထားသော အစီအစဉ် သို့မဟုတ် တန်ဖိုးကို ရှာမတွေ့ပါ။

# error_persistence_failure
source: Failed to save data locally: %@
my: ဒေတာကို စက်တွင်းသိမ်းဆည်း၍ မရပါ: %@

# error_unknown
source: An unexpected error occurred: %@
my: မမျှော်လင့်ထားသော အမှားတစ်ခု ဖြစ်ပွားပါသည်: %@

# error_unrecognized_operator
source: Unrecognized telecom operator for this phone number.
my: ဤဖုန်းနံပါတ်အတွက် ဆက်သွယ်ရေးအော်ပရေတာကို မသိရှိပါ။

# filter_all
source: All
my: အားလုံး

# filter_apply
source: Apply Filters
my: စစ်ထုတ်မှုများ အသုံးပြုရန်

# filter_date_7days
source: Last 7 Days
my: လွန်ခဲ့သော ၇ ရက်

# filter_date_30days
source: Last 30 Days
my: လွန်ခဲ့သော ရက် ၃၀

# filter_date_all
source: All Time
my: အချိန်အားလုံး

# filter_date_custom
source: Custom Range
my: စိတ်ကြိုက်ကာလ

# filter_date_range
source: Date Range
my: ရက်စွဲအပိုင်းအခြား

# filter_date_today
source: Today
my: ယနေ့

# filter_end_date
source: End Date
my: ပြီးဆုံးရက်

# filter_operator
source: Operator
my: အော်ပရေတာ

# filter_reset
source: Reset
my: ပြန်လည်သတ်မှတ်ရန်

# filter_start_date
source: Start Date
my: စတင်ရက်

# filter_status
source: Status
my: အခြေအနေ

# filter_title
source: Filter Transactions
my: ငွေလွှဲမှတ်တမ်းများကို စစ်ထုတ်ရန်

# history_empty_description
source: Your completed mobile top-ups and transactions will appear here.
my: ပြီးမြောက်သော မိုဘိုင်းငွေဖြည့်မှုများနှင့် ငွေလွှဲမှတ်တမ်းများကို ဤနေရာတွင် ပြသပါမည်။

# history_empty_title
source: No Transactions Yet
my: ငွေလွှဲမှတ်တမ်း မရှိသေးပါ

# history_no_search_results_description
source: No transactions matched your search criteria or filters.
my: သင်၏ရှာဖွေမှု သို့မဟုတ် စစ်ထုတ်မှုနှင့် ကိုက်ညီသော မှတ်တမ်းမရှိပါ။

# history_no_search_results_title
source: No Results Found
my: ရလဒ်မတွေ့ပါ

# home_balance_accessibility_format
source: Total balance: %@
my: လက်ကျန်ငွေ စုစုပေါင်း: %@

# home_balance_currency
source: Ks
my: ကျပ်

# home_balance_hide
source: Hide balance
my: လက်ကျန်ငွေကို ဖျောက်ရန်

# home_balance_show
source: Show balance
my: လက်ကျန်ငွေကို ပြရန်

# home_balance_title
source: Total Balance
my: လက်ကျန်ငွေ စုစုပေါင်း

# home_quick_actions_title
source: Quick Actions
my: အမြန်လုပ်ဆောင်ချက်များ

# home_screen_title
source: Home
my: ပင်မ

# language_burmese
source: Burmese
my: မြန်မာ

# language_english
source: English
my: အင်္ဂလိပ်

# nav_history
source: History
my: မှတ်တမ်း

# nav_home
source: Home
my: ပင်မ

# nav_profile
source: Profile
my: ပရိုဖိုင်

# nav_top_up
source: Mobile Top-Up
my: မိုဘိုင်းငွေဖြည့်

# operator_all
source: All Operators
my: အော်ပရေတာအားလုံး

# operator_unknown
source: Unknown Operator
my: မသိရှိသော အော်ပရေတာ

# placeholder_empty_screen
source: Screen under construction
my: မျက်နှာပြင်ကို တည်ဆောက်နေဆဲဖြစ်သည်

# profile_language_description
source: Choose the language used throughout myWallet.
my: myWallet တွင် အသုံးပြုမည့် ဘာသာစကားကို ရွေးချယ်ပါ။

# profile_language_setting
source: Language
my: ဘာသာစကား

# profile_menu_appearance
source: Appearance
my: အသွင်အပြင်

# profile_screen_title
source: Profile
my: ပရိုဖိုင်

# profile_section_preferences
source: Preferences
my: စိတ်ကြိုက်သတ်မှတ်ချက်များ

# profile_theme_dark
source: Dark Mode
my: အမှောင်မုဒ်

# profile_theme_description
source: Choose whether myWallet appearance matches your device settings or stays in Light or Dark mode.
my: myWallet အသွင်အပြင်ကို စက်၏သတ်မှတ်ချက်အတိုင်း အသုံးပြုမည် သို့မဟုတ် အလင်း/အမှောင်မုဒ်ကို ရွေးချယ်မည်။

# profile_theme_light
source: Light Mode
my: အလင်းမုဒ်

# profile_theme_setting
source: Appearance
my: အသွင်အပြင်

# profile_theme_system
source: System Default
my: စက်သတ်မှတ်ချက်

# recharge_alert_title
source: Plan Unavailable
my: အစီအစဉ် မရရှိနိုင်ပါ

# recharge_plan_unavailable
source: The previous top-up plan is no longer available. Please select a new plan.
my: ယခင်ငွေဖြည့်အစီအစဉ်ကို မရရှိနိုင်တော့ပါ။ အစီအစဉ်အသစ်တစ်ခု ရွေးချယ်ပါ။

# recovery_generic
source: Please restart the application or contact support if the issue persists.
my: ပြဿနာဆက်လက်ဖြစ်ပွားပါက အက်ပ်ကို ပြန်လည်စတင်ပါ သို့မဟုတ် အကူအညီတောင်းခံပါ။

# recovery_invalid_phone_number
source: Ensure the number starts with 09 and is 9 to 11 digits long.
my: နံပါတ်သည် ၀၉ ဖြင့်စပြီး ဂဏန်း ၉ မှ ၁၁ လုံးအထိ ဖြစ်ရပါမည်။

# recovery_network_failure
source: Please verify your internet connection and retry.
my: အင်တာနက်ချိတ်ဆက်မှုကို စစ်ဆေးပြီး ထပ်မံကြိုးစားပါ။

# recovery_package_not_found
source: Select an available package from the list.
my: ရရှိနိုင်သော အစီအစဉ်တစ်ခုကို ရွေးချယ်ပါ။

# recovery_unrecognized_operator
source: Check the operator prefix or try another number.
my: အော်ပရေတာ၏ ရှေ့ဂဏန်းများကို စစ်ဆေးပါ သို့မဟုတ် အခြားနံပါတ်ကို စမ်းကြည့်ပါ။

# status_failed
source: Failed
my: မအောင်မြင်ပါ

# status_pending
source: Pending
my: စောင့်ဆိုင်းနေသည်

# status_success
source: Success
my: အောင်မြင်သည်

# top_up_amount_format
source: %@ Ks
my: %@ ကျပ်

# top_up_amount_section_title
source: Top-Up Amount
my: ငွေဖြည့်တန်ဖိုး

# top_up_badge_hot
source: HOT
my: လူကြိုက်များ

# top_up_data_packages
source: Data Packages
my: ဒေတာအစီအစဉ်များ

# top_up_denominations
source: Top-Up
my: ငွေဖြည့်

# top_up_detail_amount
source: Amount
my: တန်ဖိုး

# top_up_detail_operator
source: Operator
my: အော်ပရေတာ

# top_up_detail_plan
source: Plan
my: အစီအစဉ်

# top_up_detail_recipient
source: Recipient
my: လက်ခံသူ

# top_up_detail_summary_title
source: Order Summary
my: မှာယူမှု အနှစ်ချုပ်

# top_up_detail_title
source: Top-Up Confirmation
my: ငွေဖြည့်အတည်ပြုချက်

# top_up_detail_total
source: Total Amount
my: စုစုပေါင်းတန်ဖိုး

# top_up_error_enter_valid_phone
source: Please enter a valid mobile number
my: မှန်ကန်သော မိုဘိုင်းဖုန်းနံပါတ်ကို ထည့်ပါ

# top_up_fee
source: Fee
my: ဝန်ဆောင်ခ

# top_up_free_fee
source: 0 Ks
my: ၀ ကျပ်

# top_up_packages_section_title
source: Packages & Plans
my: အစီအစဉ်များ

# top_up_phone_placeholder
source: Enter mobile number (e.g. 09...)
my: မိုဘိုင်းဖုန်းနံပါတ် ထည့်ပါ (ဥပမာ ၀၉...)

# top_up_receipt_reference
source: Reference Number
my: ရည်ညွှန်းနံပါတ်

# top_up_receipt_status
source: Status
my: အခြေအနေ

# top_up_receipt_time
source: Date & Time
my: ရက်စွဲနှင့် အချိန်

# top_up_status_success
source: Success
my: အောင်မြင်ပါသည်

# top_up_success_message
source: Your mobile recharge was successful.
my: သင်၏ မိုဘိုင်းငွေဖြည့်မှု အောင်မြင်ပါသည်။

# top_up_success_title
source: Top-Up Successful
my: ငွေဖြည့်မှု အောင်မြင်ပါသည်

# top_up_title
source: Mobile Top-Up
my: မိုဘိုင်းငွေဖြည့်

# transaction_detail_title
source: Transaction Details
my: ငွေလွှဲအသေးစိတ်

# transaction_history_empty
source: No transactions found
my: ငွေလွှဲမှတ်တမ်း မတွေ့ပါ

# transaction_history_search_placeholder
source: Search phone, operator, or reference
my: ဖုန်း၊ အော်ပရေတာ သို့မဟုတ် ရည်ညွှန်းနံပါတ်ကို ရှာပါ

# transaction_history_title
source: Transaction History
my: ငွေလွှဲမှတ်တမ်း

source: Transaction not found.
my: ငွေလွှဲမှတ်တမ်း မတွေ့ပါ။

# transaction_type_payment
source: Payment
my: ငွေပေးချေမှု

# transaction_type_top_up
source: Mobile Top-Up
my: မိုဘိုင်းငွေဖြည့်

# transaction_type_transfer
source: Transfer
my: ငွေလွှဲမှု
